## 1.Series

In [1]:
import pandas as pd

In [2]:
data=[1,2,3,4]
s1=pd.Series(data)
s1

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s1.values

array([1, 2, 3, 4], dtype=int64)

In [4]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
s1.index=['a','b','c','d']

In [6]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
s1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
s1['b']

2

In [9]:
s1.loc['a']

1

In [10]:
s1.iloc[3]

4

In [11]:
s1['e']=5

In [12]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
s1['a']=2

In [14]:
s1

a    2
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
s1.loc['f']=6

In [16]:
s1

a    2
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [17]:
s1.loc

In [18]:
1 in s1.values

False

In [19]:
'a' in s1.index

True

In [20]:
s1[1:5]

b    2
c    3
d    4
e    5
dtype: int64

In [21]:
data={'Jaipur': 'Rajasthan','Mumbai':'Maharashtra','kolkata':'west bengal','chandigarh':'punjab'}
s2=pd.Series(data)

In [22]:
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
kolkata       west bengal
chandigarh         punjab
dtype: object

In [23]:
s2.name='States'

In [24]:
s2.index.name='Capital'

In [25]:
s2

Capital
Jaipur          Rajasthan
Mumbai        Maharashtra
kolkata       west bengal
chandigarh         punjab
Name: States, dtype: object

In [26]:
s2['Jaipur']

'Rajasthan'

In [27]:
s2[1]

'Maharashtra'

In [28]:
s2[['Jaipur','kolkata','chandigarh']]

Capital
Jaipur          Rajasthan
kolkata       west bengal
chandigarh         punjab
Name: States, dtype: object

In [29]:
capitals=['Jaipur','kolkata','chandigarh']
s3=pd.Series(data,index=capitals)

In [30]:
s3

Jaipur          Rajasthan
kolkata       west bengal
chandigarh         punjab
dtype: object

In [31]:
s3.isnull()

Jaipur        False
kolkata       False
chandigarh    False
dtype: bool

In [32]:
s2.isnull()

Capital
Jaipur        False
Mumbai        False
kolkata       False
chandigarh    False
Name: States, dtype: bool

In [33]:
s1.isnull()

a    False
b    False
c    False
d    False
e    False
f    False
dtype: bool

In [34]:
capitals2=['Jaipur','kolkata','chandigarh']
s4=pd.Series(data,index=capitals2)
s4

Jaipur          Rajasthan
kolkata       west bengal
chandigarh         punjab
dtype: object

In [35]:
s4.isnull()

Jaipur        False
kolkata       False
chandigarh    False
dtype: bool

In [36]:
s4.notnull()   #used for when there is no null values

Jaipur        True
kolkata       True
chandigarh    True
dtype: bool

In [37]:
s=pd.Series(['India','Australia','England'],index=['Cricket','Cricket','Cricket'])
s

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

In [38]:
s.loc['Cricket']

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

In [39]:
colors=['Blue','Red',None]
pd.Series(colors)

0    Blue
1     Red
2    None
dtype: object

In [40]:
numbers=[1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

 ## Dataframe

In [41]:
student1 = pd.Series({'Name' : 'Utkarsh',
                     'Id' : 1})
student2 = pd.Series({'Name' : 'Amit',
                     'Id' : 2})
student3 = pd.Series({'Name' : 'Ankit',
                     'Id' : 3})

In [42]:
df1=pd.DataFrame([student1,student2,student3],index=(101,102,103))

In [43]:
df1

        Name  Id
101  Utkarsh   1
102     Amit   2
103    Ankit   3

In [44]:
data={'Name':["utkarsh",'Amit','Ankit'],'ID':[1,2,3]}
df2=pd.DataFrame(data,index=[101,102,103])
df2

        Name  ID
101  utkarsh   1
102     Amit   2
103    Ankit   3

In [45]:
df2.head()

        Name  ID
101  utkarsh   1
102     Amit   2
103    Ankit   3

In [46]:
df3=pd.DataFrame(data,index=[101,102,103],columns=['Name','ID',"age"])
df3

        Name  ID  age
101  utkarsh   1  NaN
102     Amit   2  NaN
103    Ankit   3  NaN

In [47]:
df3.age

101    NaN
102    NaN
103    NaN
Name: age, dtype: object

In [48]:
df3.age=23

In [49]:
df3.age

101    23
102    23
103    23
Name: age, dtype: int64

In [50]:
df3

        Name  ID  age
101  utkarsh   1   23
102     Amit   2   23
103    Ankit   3   23

In [51]:
df3.age['102']=22

C:\Users\pc\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [52]:
df3

        Name  ID  age
101  utkarsh   1   23
102     Amit   2   23
103    Ankit   3   23

In [53]:
df3.columns

Index(['Name', 'ID', 'age'], dtype='object')

In [54]:
df3.values

array([['utkarsh', 1, 23],
       ['Amit', 2, 23],
       ['Ankit', 3, 23]], dtype=object)

In [55]:
df3['Name']

101    utkarsh
102       Amit
103      Ankit
Name: Name, dtype: object

In [56]:
df3.Name

101    utkarsh
102       Amit
103      Ankit
Name: Name, dtype: object

In [57]:
df3.iloc[0]

Name    utkarsh
ID            1
age          23
Name: 101, dtype: object

In [58]:
df3.loc[101]

Name    utkarsh
ID            1
age          23
Name: 101, dtype: object

In [59]:
df3.loc[102]=['Abhi',5,24]

In [60]:
df3

        Name  ID  age
101  utkarsh   1   23
102     Abhi   5   24
103    Ankit   3   23

In [61]:
df3.loc[104]=['Amlesh',6,23]

In [62]:
df3

        Name  ID  age
101  utkarsh   1   23
102     Abhi   5   24
103    Ankit   3   23
104   Amlesh   6   23

In [63]:
df3.loc[103]['Name']

'Ankit'

In [64]:
df3['age'][103]=26

C:\Users\pc\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [65]:
df3

        Name  ID  age
101  utkarsh   1   23
102     Abhi   5   24
103    Ankit   3   26
104   Amlesh   6   23

In [66]:
val = pd.Series([21,23,25,24], index = [101,102,103,104])

In [67]:
df3['age']=val
df3

        Name  ID  age
101  utkarsh   1   21
102     Abhi   5   23
103    Ankit   3   25
104   Amlesh   6   24

In [68]:
val2=pd.Series([6,5],index=[101,103])
df3['Height']=val2

In [69]:
df3

        Name  ID  age  Height
101  utkarsh   1   21     6.0
102     Abhi   5   23     NaN
103    Ankit   3   25     5.0
104   Amlesh   6   24     NaN

In [70]:
df3['weight']=df3.age
df3

        Name  ID  age  Height  weight
101  utkarsh   1   21     6.0      21
102     Abhi   5   23     NaN      23
103    Ankit   3   25     5.0      25
104   Amlesh   6   24     NaN      24

In [71]:
df3.drop(104)

        Name  ID  age  Height  weight
101  utkarsh   1   21     6.0      21
102     Abhi   5   23     NaN      23
103    Ankit   3   25     5.0      25

In [72]:
df3

        Name  ID  age  Height  weight
101  utkarsh   1   21     6.0      21
102     Abhi   5   23     NaN      23
103    Ankit   3   25     5.0      25
104   Amlesh   6   24     NaN      24

In [73]:
df3.drop([101,102,103])

       Name  ID  age  Height  weight
104  Amlesh   6   24     NaN      24

In [74]:
df3

        Name  ID  age  Height  weight
101  utkarsh   1   21     6.0      21
102     Abhi   5   23     NaN      23
103    Ankit   3   25     5.0      25
104   Amlesh   6   24     NaN      24

In [75]:
df3.T

            101   102    103     104
Name    utkarsh  Abhi  Ankit  Amlesh
ID            1     5      3       6
age          21    23     25      24
Height        6   NaN      5     NaN
weight       21    23     25      24

In [76]:
del df3['weight']

In [77]:
df3

        Name  ID  age  Height
101  utkarsh   1   21     6.0
102     Abhi   5   23     NaN
103    Ankit   3   25     5.0
104   Amlesh   6   24     NaN

In [78]:
df3

        Name  ID  age  Height
101  utkarsh   1   21     6.0
102     Abhi   5   23     NaN
103    Ankit   3   25     5.0
104   Amlesh   6   24     NaN

In [79]:
df3.index.name='students'
df3.columns.name='details'
df3

details      Name  ID  age  Height
students
101       utkarsh   1   21     6.0
102          Abhi   5   23     NaN
103         Ankit   3   25     5.0
104        Amlesh   6   24     NaN

In [82]:
index=df3.index
index[1]='A'        # here this is an immutable opeartion

TypeError: Index does not support mutable operations

In [83]:
df4=df3.reindex([201,202,203,204])
df4

details  Name  ID  age  Height
students
201       NaN NaN  NaN     NaN
202       NaN NaN  NaN     NaN
203       NaN NaN  NaN     NaN
204       NaN NaN  NaN     NaN

In [84]:
df7=df3

In [85]:
df7

details      Name  ID  age  Height
students
101       utkarsh   1   21     6.0
102          Abhi   5   23     NaN
103         Ankit   3   25     5.0
104        Amlesh   6   24     NaN

In [86]:
df7=df3.reindex([201,202,203,204])

In [87]:
df7

details  Name  ID  age  Height
students
201       NaN NaN  NaN     NaN
202       NaN NaN  NaN     NaN
203       NaN NaN  NaN     NaN
204       NaN NaN  NaN     NaN

In [88]:
df3.dropna()

details      Name  ID  age  Height
students
101       utkarsh   1   21     6.0
103         Ankit   3   25     5.0

In [89]:
df3.fillna(0)

details      Name  ID  age  Height
students
101       utkarsh   1   21     6.0
102          Abhi   5   23     0.0
103         Ankit   3   25     5.0
104        Amlesh   6   24     0.0

In [90]:
df3.set_index(['Name'])

details  ID  age  Height
Name
utkarsh   1   21     6.0
Abhi      5   23     NaN
Ankit     3   25     5.0
Amlesh    6   24     NaN

In [91]:
df3.reset_index()

details  students     Name  ID  age  Height
0             101  utkarsh   1   21     6.0
1             102     Abhi   5   23     NaN
2             103    Ankit   3   25     5.0
3             104   Amlesh   6   24     NaN

## Index a dataframe

In [92]:
df3['Name']

students
101    utkarsh
102       Abhi
103      Ankit
104     Amlesh
Name: Name, dtype: object

In [93]:
df3[['Name','Height','age']]

details      Name  Height  age
students
101       utkarsh     6.0   21
102          Abhi     NaN   23
103         Ankit     5.0   25
104        Amlesh     NaN   24

In [94]:
df3.loc[102]

details
Name      Abhi
ID           5
age         23
Height     NaN
Name: 102, dtype: object

In [95]:
df3.loc[[101,103,104]]

details      Name  ID  age  Height
students
101       utkarsh   1   21     6.0
103         Ankit   3   25     5.0
104        Amlesh   6   24     NaN

In [96]:
df3.loc[[101,103],['Name','age']]

details      Name  age
students
101       utkarsh   21
103         Ankit   25

In [97]:
df3.iloc[3]

details
Name      Amlesh
ID             6
age           24
Height       NaN
Name: 104, dtype: object

In [98]:
df3.loc[:,['Name','age']]

details      Name  age
students
101       utkarsh   21
102          Abhi   23
103         Ankit   25
104        Amlesh   24

In [99]:
df3.sort_index()

details      Name  ID  age  Height
students
101       utkarsh   1   21     6.0
102          Abhi   5   23     NaN
103         Ankit   3   25     5.0
104        Amlesh   6   24     NaN

In [100]:
df3.sort_values(by='Name')

details      Name  ID  age  Height
students
102          Abhi   5   23     NaN
104        Amlesh   6   24     NaN
103         Ankit   3   25     5.0
101       utkarsh   1   21     6.0

In [101]:
df3['Name'].unique()

array(['utkarsh', 'Abhi', 'Ankit', 'Amlesh'], dtype=object)

## Descriptive Statistics

In [102]:
import numpy as np

In [103]:
data = {'A' : np.arange(11,21),
     'B' : np.arange(21,31),
     'C' : np.arange(31,41)}

In [104]:
df=pd.DataFrame(data)
df

    A   B   C
0  11  21  31
1  12  22  32
2  13  23  33
3  14  24  34
4  15  25  35
5  16  26  36
6  17  27  37
7  18  28  38
8  19  29  39
9  20  30  40

In [105]:
df.sum()

A    155
B    255
C    355
dtype: int64

In [106]:
df.sum(axis=1)

0    63
1    66
2    69
3    72
4    75
5    78
6    81
7    84
8    87
9    90
dtype: int64

In [107]:
df.sum(axis=0)

A    155
B    255
C    355
dtype: int64

In [108]:
df.mean()

A    15.5
B    25.5
C    35.5
dtype: float64

In [109]:
df.mean(axis=1)

0    21.0
1    22.0
2    23.0
3    24.0
4    25.0
5    26.0
6    27.0
7    28.0
8    29.0
9    30.0
dtype: float64

In [110]:
df.mean(skipna=True)

A    15.5
B    25.5
C    35.5
dtype: float64

In [111]:
df.min()

A    11
B    21
C    31
dtype: int32

In [112]:
df.max()

A    20
B    30
C    40
dtype: int32

In [113]:
df.var()

A    9.166667
B    9.166667
C    9.166667
dtype: float64

In [114]:
df.std()

A    3.02765
B    3.02765
C    3.02765
dtype: float64

In [115]:
df.median()

A    15.5
B    25.5
C    35.5
dtype: float64

In [116]:
df.describe()

              A         B         C
count  10.00000  10.00000  10.00000
mean   15.50000  25.50000  35.50000
std     3.02765   3.02765   3.02765
min    11.00000  21.00000  31.00000
25%    13.25000  23.25000  33.25000
50%    15.50000  25.50000  35.50000
75%    17.75000  27.75000  37.75000
max    20.00000  30.00000  40.00000

In [117]:
df.describe().T

   count  mean      std   min    25%   50%    75%   max
A   10.0  15.5  3.02765  11.0  13.25  15.5  17.75  20.0
B   10.0  25.5  3.02765  21.0  23.25  25.5  27.75  30.0
C   10.0  35.5  3.02765  31.0  33.25  35.5  37.75  40.0

## End